MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK60DN256ZVLQ10/mcu.h
#define Reserved                      0x7FFF80000000      // This read-only field is reserved and always has the value zero.
#define TPR                           0x7FFF8000      // Time Prescaler Register


//*****************************************************************************
//
// The following are defines for the bit fields in the RTC_TAR register.
//
//*****************************************************************************

#define TAR                           0x7FFFFFFF80000000      // Time Alarm Register


//*****************************************************************************
//
// The following are defines for the bit fields in the RTC_TCR register.
//
//*****************************************************************************

#define CIC                           0x7F80000000      // Compensation Interval Counter
#define TCV                           0x7F800000      // Time Compensation Value
#define CIR                           0x007F8000      // Compensation Interval Register
#define TCR                           0x00007F80      // Time Compensation Register


//*****************************************************************************
//
// The following are defines for the bit fields in the RTC_CR register.
//
//*****************************************************************************

#define SC2P                          0x00002000      // Oscillator 2pF load configure
#define SC4P                          0x00001000      // Oscillator 4pF load configure
#define SC8P                          0x00000800      // Oscillator 8pF load configure
#define SC16P                         0x00000400      // Oscillator 16pF load configure
#define CLKO                          0x00000200      // Clock Output
#define OSCE                          0x00000100      // Oscillator Enable
#define UM                            0x00000008      // Update Mode
#define SUP                           0x00000004      // Supervisor Access
#define WPE                           0x00000002      // Wakeup Pin Enable
#define SWR                           0x00000001      // Software Reset


//*****************************************************************************
//
// The following are defines for the bit fields in the RTC_SR register.
//
//*****************************************************************************

#define TCE                           0x00000010      // Time Counter Enable
#define TAF                           0x00000004      // Time Alarm Flag
#define TOF                           0x00000002      // Time Overflow Flag
#define TIF                           0x00000001      // Time Invalid Flag


//*****************************************************************************
//
// The following are defines for the bit fields in the RTC_LR register.
//
//*****************************************************************************

#define Reserved                      0x00000080      // This read-only field is reserved and always has the value one.
#define LRL                           0x00000040      // Lock Register Lock
#define SRL                           0x00000020      // Status Register Lock
#define CRL                           0x00000010      // Control Register Lock
#define TCL                           0x00000008      // Time Compensation Lock


//*****************************************************************************
//
// The following are defines for the bit fields in the RTC_IER register.
//
//*****************************************************************************

#define TAIE                          0x00000004      // Time Alarm Interrupt Enable
#define TOIE                          0x00000002      // Time Overflow Interrupt Enable
#define TIIE                          0x00000001      // Time Invalid Interrupt Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the RTC_WAR register.
//
//*****************************************************************************

#define IERW                          0x00000080      // Interrupt Enable Register Write
#define LRW                           0x00000040      // Lock Register Write
#define SRW                           0x00000020      // Status Register Write
#define CRW                           0x00000010      // Control Register Write
#define TCRW                          0x00000008      // Time Compensation Register Write
#define TARW                          0x00000004      // Time Alarm Register Write
#define TPRW                          0x00000002      // Time Prescaler Register Write
#define TSRW                          0x00000001      // Time Seconds Register Write


//*****************************************************************************
//
// The following are defines for the bit fields in the RTC_RAR register.
//
//*****************************************************************************

#define IERR                          0x00000080      // Interrupt Enable Register Read
#define LRR                           0x00000040      // Lock Register Read
#define SRR                           0x00000020      // Status Register Read


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_EIR register.
//
//*****************************************************************************

#define -                             0x80000000      // This read-only field is reserved and always has the value zero.
#define BABR                          0x40000000      // Babbling Receive Error
#define BABT                          0x20000000      // Babbling Transmit Error
#define GRA                           0x10000000      // Graceful Stop Complete
#define TXF                           0x08000000      // Transmit Frame Interrupt
#define TXB                           0x04000000      // Transmit Buffer Interrupt
#define RXF                           0x02000000      // Receive Frame Interrupt
#define RXB                           0x01000000      // Receive Buffer Interrupt.
#define MII                           0x00800000      // MII Interrupt.
#define EBERR                         0x00400000      // Ethernet Bus Error
#define LC                            0x00200000      // Late Collision
#define RL                            0x00100000      // Collision Retry Limit.
#define UN                            0x00080000      // Transmit FIFO underrun
#define PLR                           0x00040000      // Payload receive error
#define WAKEUP                        0x00020000      // Node wake-up request indication
#define TS_AVAIL                      0x00010000      // Transmit timestamp available
#define TS_TIMER                      0x00008000      // Timestamp timer


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_EIMR register.
//
//*****************************************************************************

